openfoam9/tutorials/multiphase/compressibleInterFoam/laminar/plateFilm/Allrun
#!/bin/sh
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

# Get application name
application=$(getApplication)

runApplication blockMesh
runApplication topoSet
runApplication extrudeToRegionMesh -overwrite

runApplication setFields

runApplication $application

#------------------------------------------------------------------------------
